Revit 2024 API
ParameterMapIterator Class
An iterator to a map relating a parameter name (the key, a String) to a parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class ParameterMapIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class ParameterMapIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class ParameterMapIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ParameterMapIterator
See Also
ParameterMapIterator Members
Autodesk.Revit.DB Namespace